RIET/src/Catalogs/Parcels/Parcels.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Parcels</name>
  <attributes>
    <name>DONo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExportRequest</name>
    <type>
      <types>DocumentRef.ExportRequest</types>
    </type>
  </attributes>
  <attributes>
    <name>TransportRequest</name>
    <type>
      <types>DocumentRef.TransportRequest</types>
    </type>
  </attributes>
  <attributes>
    <name>PackingType</name>
    <type>
      <types>CatalogRef.PackingTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬPackingType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SerialNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Length</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Width</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Height</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DIMsUOM</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </attributes>
  <attributes>
    <name>LengthCM</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WidthCM</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HeightCM</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CubicMeters</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GrossWeight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NetWeight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WeightUOM</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossWeightKG</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NetWeightKG</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VolumeWeight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ChargeableWeight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LocalOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>POList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseFrom</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseTo</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Urgency</name>
    <type>
      <types>EnumRef.Urgencies</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Repacked</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HazardClass</name>
    <type>
      <types>CatalogRef.HazardClasses</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionOfItems</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SpecialHandling</name>
    <type>
      <types>CatalogRef.SpecialHandling</types>
    </type>
  </attributes>
  <attributes>
    <name>NumOfParcels</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RDD</name>
    <comment>Required delivery date</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeliveredToWH</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LocalImpacked</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SpecialInstructions</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>SuppliersList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LengthCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WidthCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HeightCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CubicMetersCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GrossWeightCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LengthCMCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WidthCMCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HeightCMCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GrossWeightKGCorrected</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Детали</name>
    <attributes>
      <name>СтрокаИнвойса</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявкиНаЗакупку</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаЗаявкиНаЗакупку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Receiver</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Qty</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>QtyUOM</name>
      <type>
        <types>CatalogRef.UOMs</types>
      </type>
    </attributes>
    <attributes>
      <name>NetWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GrossWeightKG</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ChargeableWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Catalogs/Parcels/ManagerModule.bsl
Функция ЗаполнитьInvoiceLineВParcelLine(ParcelLine, DONo, LocalOnly, ExportRequest, TransportRequest, CurrentParcel, ParcelGoods) Экспорт
	
	СоответствиеInvoiceLinesИQty = ImportExportКлиентСервер.ПолучитьСоответствиеInvoiceLineИParcelQty(ParcelGoods, ParcelLine.НомерСтроки);
	
	ТаблицаInvoiceLines = ПолучитьТаблицуInvoiceLinesПодходящихДляParcelLine(DONo, LocalOnly, ExportRequest, TransportRequest, CurrentParcel, СоответствиеInvoiceLinesИQty, ParcelLine);
	
	КоличествоНайденныхInvoiceLines = ТаблицаInvoiceLines.Количество();
	Если КоличествоНайденныхInvoiceLines = 1 Тогда
		
		ParcelLine.СтрокаИнвойса = ТаблицаInvoiceLines[0].InvoiceLine;
		ImportExportКлиентСервер.ПерезаполнитьParcelLineПоInvoiceLineПриНеобходимости(ЗначениеЗаполнено(ExportRequest), ParcelLine, ТаблицаInvoiceLines[0]);
			
	КонецЕсли;	
	
	Возврат КоличествоНайденныхInvoiceLines;
	
КонецФункции

Функция ПолучитьТаблицуInvoiceLinesПодходящихДляParcelLine(DONo, LocalOnly, ExportRequest, TransportRequest, 
		CurrentParcel, СоответствиеInvoiceLinesИQty, ParcelLine) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("CurrentParcel", CurrentParcel);
		
	Запрос.Текст =
		"ВЫБРАТЬ
		|	InvoiceLine.Ссылка КАК InvoiceLine,
		|	InvoiceLine.НомерЗаявкиНаЗакупку КАК PONo,
		|	InvoiceLine.СтрокаЗаявкиНаЗакупку.НомерСтрокиЗаявкиНаЗакупку КАК POLineNo,
		|	InvoiceLine.Количество КАК Qty,
		|	InvoiceLine.ЕдиницаИзмерения КАК UOM,
		|	InvoiceLine.ImportReference КАК Reference,
		|	InvoiceLine.СерийныйНомер КАК SerialNo,
		|	InvoiceLine.NetWeight,
		|	СУММА(ЕСТЬNULL(ParcelsItems.Qty, 0)) КАК ParcelsQty
		|ИЗ
		|	Справочник.СтрокиИнвойса КАК InvoiceLine
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Parcels.Детали КАК ParcelsItems
		|		ПО InvoiceLine.Ссылка = ParcelsItems.СтрокаИнвойса
		|			И ((НЕ ParcelsItems.Ссылка.Отменен))
		|			И (ParcelsItems.Ссылка <> &CurrentParcel)
		|ГДЕ
		|	(НЕ InvoiceLine.ПометкаУдаления)";
		
	Если LocalOnly Тогда
		
		Если ЗначениеЗаполнено(TransportRequest) Тогда
			
			Запрос.УстановитьПараметр("TransportRequest", TransportRequest);
			Запрос.Текст = Запрос.Текст + "
			|	И InvoiceLine.TransportRequest = &TransportRequest";
			
			МинимальноеQty = 1;
			
		иначе
			
			// В локальных парселях инвойс и export request должен быть пустым, 
			// а количество в определенных случаях может быть нулевым
			Запрос.Текст = Запрос.Текст + "
			|	И InvoiceLine.Инвойс = ЗНАЧЕНИЕ(Документ.Инвойс.ПустаяСсылка)
			|	И InvoiceLine.ExportRequest = ЗНАЧЕНИЕ(Документ.ExportRequest.ПустаяСсылка)
			|	И (Invoiceline.Количество > 0 ИЛИ InvoiceLine.Количество = 0 И ParcelsItems.Qty ЕСТЬ NULL)";
			
			МинимальноеQty = 0;
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ExportRequest) Тогда
		
		Запрос.УстановитьПараметр("ExportRequest", ExportRequest);
		Запрос.Текст = Запрос.Текст + "
			|	И InvoiceLine.ExportRequest = &ExportRequest";
			
		МинимальноеQty = 1;
		
	Иначе		
		
		// В импортных парселях инвойс не должен быть отменен
		Запрос.Текст = Запрос.Текст + "
			|	И InvoiceLine.Инвойс.Отменен = ЛОЖЬ";
			
		Запрос.УстановитьПараметр("DONo", DONo);
		Запрос.Текст = Запрос.Текст + "
			|	И InvoiceLine.Инвойс.НомерЗаявкиНаДоставку = &DONo";
			
		МинимальноеQty = 1;
			
	КонецЕсли; 	
	
	Если ParcelLine <> Неопределено Тогда
		
		Если НЕ ЗначениеЗаполнено(ExportRequest) И НЕ ЗначениеЗаполнено(TransportRequest) Тогда
			
			PONo = СокрЛП(ParcelLine.НомерЗаявкиНаЗакупку);
			Если ЗначениеЗаполнено(PONo) Тогда
				
				Запрос.УстановитьПараметр("PONo", PONo);
				Запрос.Текст = Запрос.Текст + "
					|	И InvoiceLine.НомерЗаявкиНаЗакупку = &PONo";
					
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ParcelLine.СтрокаЗаявкиНаЗакупку) Тогда
				
				Запрос.УстановитьПараметр("POLineNo", ParcelLine.СтрокаЗаявкиНаЗакупку);
				Запрос.Текст = Запрос.Текст + "
					|	И InvoiceLine.СтрокаЗаявкиНаЗакупку.НомерСтрокиЗаявкиНаЗакупку = &POLineNo";
					
			КонецЕсли; 
			
			Receiver = СокрЛП(ParcelLine.Receiver);
			Если ЗначениеЗаполнено(Receiver) Тогда
				
				Запрос.УстановитьПараметр("Receiver", Receiver);
				Запрос.Текст = Запрос.Текст + "
					|	И InvoiceLine.ImportReference = &Receiver";
				
			КонецЕсли; 
			
		КонецЕсли;
			
		SerialNo = СокрЛП(ParcelLine.СерийныйНомер);
		Если ЗначениеЗаполнено(SerialNo) Тогда
			
			Запрос.УстановитьПараметр("SerialNo", SerialNo);
			Запрос.Текст = Запрос.Текст + "
				|	И InvoiceLine.СерийныйНомер = &SerialNo";
				
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ParcelLine.Qty) Тогда
			
			Запрос.УстановитьПараметр("Qty", ParcelLine.Qty);	
			Запрос.Текст = Запрос.Текст + "
				|	И InvoiceLine.Количество >= &Qty";
				
			МинимальноеQty = ParcelLine.Qty;
			
		КонецЕсли; 
			
		Если ЗначениеЗаполнено(ParcelLine.QtyUOM) Тогда
			
			Запрос.УстановитьПараметр("QtyUOM", ParcelLine.QtyUOM);
			Запрос.Текст = Запрос.Текст + "
				|	И InvoiceLine.ЕдиницаИзмерения = &QtyUOM";
				
		КонецЕсли; 
			
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
		|
		|СГРУППИРОВАТЬ ПО
		|	InvoiceLine.Ссылка,
		|	InvoiceLine.НомерЗаявкиНаЗакупку,
		|	InvoiceLine.СтрокаЗаявкиНаЗакупку.НомерСтрокиЗаявкиНаЗакупку,
		|	InvoiceLine.Количество,
		|	InvoiceLine.ЕдиницаИзмерения,
		|	InvoiceLine.ImportReference,
		|	InvoiceLine.NetWeight,
		|	InvoiceLine.СерийныйНомер
		|
		|ИМЕЮЩИЕ InvoiceLine.Количество = 0 ИЛИ InvoiceLine.Количество > СУММА(ЕСТЬNULL(ParcelsItems.Qty, 0))";
		
	Таблица = Запрос.Выполнить().Выгрузить();
	
	// Отфильтруем таблицу по свободному количеству
	ы = 0;
	Пока ы < Таблица.Количество() Цикл
		
		СтрокаТаблицы = Таблица[ы];
		
		QtyInCurrentParcel = СоответствиеInvoiceLinesИQty.Получить(СтрокаТаблицы.InvoiceLine);
		Если QtyInCurrentParcel <> Неопределено Тогда
			СтрокаТаблицы.ParcelsQty = СтрокаТаблицы.ParcelsQty + QtyInCurrentParcel;
		КонецЕсли; 
		
		Если (СтрокаТаблицы.Qty - СтрокаТаблицы.ParcelsQty) < МинимальноеQty Тогда
			Таблица.Удалить(СтрокаТаблицы);
		Иначе
			ы = ы + 1;
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат Таблица;
	
КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если (Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("TransportRequest")) 
		ИЛИ (Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования.TransportRequest))
		ИЛИ (Параметры.Свойство("Ключ") И ЗначениеЗаполнено(
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "TransportRequest"))) Тогда 
		
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "ФормаЭлементаДляTransportRequest";
		
	КонецЕсли;
	
КонецПроцедуры
